{"class_name": "Sequential", "keras_version": "2.1.3", "config": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "kernel_size": [3, 3], "batch_input_shape": [null, 64, 64, 3], "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_1", "strides": [1, 1], "filters": 32, "data_format": "channels_last", "activation": "linear", "dtype": "float32", "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1]}}, {"class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_constraint": null, "alpha_regularizer": null, "shared_axes": null, "name": "p_re_lu_1", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "kernel_size": [3, 3], "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_2", "strides": [1, 1], "filters": 32, "data_format": "channels_last", "activation": "linear", "padding": "valid", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1]}}, {"class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_constraint": null, "alpha_regularizer": null, "shared_axes": null, "name": "p_re_lu_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_1", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "kernel_size": [3, 3], "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_3", "strides": [1, 1], "filters": 64, "data_format": "channels_last", "activation": "linear", "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1]}}, {"class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_constraint": null, "alpha_regularizer": null, "shared_axes": null, "name": "p_re_lu_3", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "kernel_size": [3, 3], "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_4", "strides": [1, 1], "filters": 64, "data_format": "channels_last", "activation": "linear", "padding": "valid", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1]}}, {"class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_constraint": null, "alpha_regularizer": null, "shared_axes": null, "name": "p_re_lu_4", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_2", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "name": "dropout_2", "seed": null, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"units": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "name": "dense_1", "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null}}, {"class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_constraint": null, "alpha_regularizer": null, "shared_axes": null, "name": "p_re_lu_5", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "name": "dropout_3", "seed": null, "trainable": true}}, {"class_name": "Dense", "config": {"units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "name": "dense_2", "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "softmax", "trainable": true}}], "backend": "tensorflow"}